# DefinesConstantHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DefinesConstantHeight Property
ParameterTypeId Class See Also
---
"Defines Constant Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DefinesConstantHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DefinesConstantHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DefinesConstantHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace